package com.bcloud.network;

import java.util.HashMap;

/**
 * 错误码.
 */
public class ErrorMsg {
	
	public static final HashMap<Integer, String> O_MAP = new HashMap<Integer, String>() {
		{
			put(0, "成功");
		    put(-1, "用户名和密码验证失败");
		    put(-2, "备用");
		    put(-3, "用户未激活（调用init接口）");
		    put(-4, "COOKIE中未找到host_key&user_key（或BDUSS）");
		    put(-5, "host_key和user_key无效");
		    put(-6, "bduss无效");
		    put(-7, "文件或目录名错误或无权访问");
		    put(-8, "该目录下已存在此文件");
		    put(-9, "文件被所有者删除，操作失败");
		    put(-10, "你的空间不足了哟，赶紧<a target=\"_blank\" href=\"http,//yun.baidu.com/buy/center?tag=2\">购买空间</a>吧");
		    put(-11, "父目录不存在");
		    put(-12, "设备尚未注册");
		    put(-13, "设备已经被绑定");
		    put(-14, "帐号已经初始化");
		    put(-21, "预置文件无法进行相关操作");
		    put(-22, "被分享的文件无法重命名，移动等操作");
		    put(-23, "数据库操作失败，请联系netdisk管理员");
		    put(-24, "要取消的文件列表中含有不允许取消public的文件。");
		    put(-25, "非公测用户");
		    put(-26, "邀请码失效");
		    put(1, "服务器错误 ");
		    put(2, "该文件夹不可以移动");
		    put(3, "一次操作文件不可超过100个");
		    put(4, "新文件名错误");
		    put(5, "目标目录非法");
		    put(6, "备用");
		    put(7, "NS非法或无权访问");
		    put(8, "ID非法或无权访问");
		    put(9, "申请key失败");
		    put(10, "创建文件的superfile失败");
		    put(11, "user_id(或user_name)非法或不存在");
		    put(12, "部分文件已存在于目标文件夹中");
		    put(13, "此目录无法共享");
		    put(14, "系统错误");
		    put(103, "提取码错误");
		    put(104, "验证cookie无效");
		    put(201, "系统错误");
		    put(202, "系统错误");
		    put(203, "系统错误");
		    put(204, "系统错误");
		    put(205, "系统错误");
		    put(301, "其他请求出错");
		    put(501, "获取的LIST格式非法");
		    put(618, "请求curl返回失败");
		    put(619, "pcs返回错误码");
		    put(600, "json解析出错");
		    put(601, "exception抛出异常");
		    put(617, "getFilelist其他错误");
		    put(211, "无权操作或被封禁");
		    put(404, "秒传md5不匹配 rapidupload 错误码");
		    put(406, "秒传创建文件失败 rapidupload 错误码");
		    put(407, "fileModify接口返回错误，未返回requestid rapidupload 错误码");
		    put(31080, "我们的服务器出错了，稍候试试吧");
		    put(31021, "网络连接失败，请检查网络或稍候再试");
		    put(31075, "一次支持操作999个，减点试试吧");
		    put(31116, "你的空间不足了哟，赶紧<a href=\"http,//yun.baidu.com/buy/center?tag=2\">购买空间</a>吧");
		    put(112, "页面已过期，请<a href=\"javascript,window.location.reload();\">刷新</a>后重试");
		    put(111, "当前还有任务未完成,请等待当前任务结束后再进行操作");
		    put(-32, "你的空间不足了哟，赶紧<a target=\"_blank\" href=\"http,//yun.baidu.com/buy/center?tag=2\">购买空间</a>吧");
		}
	};
	public static final  HashMap<Integer, String> T_MAP=  new HashMap<Integer, String>() {
		{
			put(0, "成功");
			put(-1, "由于您分享了违反相关法律法规的文件，分享功能已被禁用，之前分享出去的文件不受影响。");
			put(-2, "用户不存在,请刷新页面后重试");
			put(-3, "文件不存在,请刷新页面后重试");
			put(-4, "登录信息有误，请重新登录试试");
			put(-5, "host_key和user_key无效");
			put(-6, "请重新登录");
			put(-7, "该分享已删除或已取消");
			put(-8, "该分享已经过期");
			put(-9, "访问密码错误");
			put(-10, "分享外链已经达到最大上限100000条，不能再次分享");
			put(-11, "验证cookie无效");
			put(-14, "对不起，短信分享每天限制20条，你今天已经分享完，请明天再来分享吧！");
			put(-15, "对不起，邮件分享每天限制20封，你今天已经分享完，请明天再来分享吧！");
			put(-16, "对不起，该文件已经限制分享！");
			put(-17, "文件分享超过限制");
			put(-30, "文件已存在");
			put(-31, "文件保存失败");
			put(-33, "一次支持操作999个，减点试试吧");
			put(-32, "你的空间不足了哟，赶紧购买空间吧");
			put(-70, "你分享的文件中包含病毒或疑似病毒，为了你和他人的数据安全，换个文件分享吧");
			put(2, "参数错误");
			put(3, "未登录或帐号无效");
			put(4, "存储好像出问题了，请稍候再试");
			put(108, "文件名有敏感词，优化一下吧");
			put(110, "分享次数超出限制，可以到“我的分享”中查看已分享的文件链接");
			put(114, "当前任务不存在，保存失败");
			put(115, "该文件禁止分享");
			put(112, "页面已过期，请<a href=\"javascript,window.location.reload();\">刷新</a>后重试");
		}
	};

	public static final  HashMap<Integer, String> I_MAP=  new HashMap<Integer, String>() {
		{
			put(36000, "网络繁忙，请稍候再试");
			put(36001, "参数错误");
			put (36002, "appid错误");
			put (36003, "请刷新再试");
			put(36004, "请重新登录");
			put (36005, "用户未登录");
			put(36006, "用户未激活");
			put(36007, "用户未授权");
			put(36008, "用户不存在");
			put (36009, "用户空间不足");
			put(36010, "文件不存在");
			put (36012, "操作超时，请重试");
			put(36013, "同时下载的任务过多，不能下载");
			put(36014, "存储路径已使用");
			put (36016, "任务已删除");
			put(36017, "任务已完成");
			put(36018, "解析失败，种子文件损坏");
			put(36019, "任务正在处理中");
			put (36020, "任务地址不存在");
			put(36021, "普通用户最多同时下载1个任务哦！马上开通离线下载套餐，立即下载更多！");
			put(36022, "同时下载的任务过多，不能下载");
			put (36023, "普通用户每月只能离线下载5个任务哦！马上开通离线下载套餐，立即下载更多！");
			put (36024, "本月下载数已超限制");
			put (36025, "分享链接已失效");
			put (36026, "链接格式有误");
			put(36027, "链接格式有误");
			put(36028, "暂时无法找到相关种子信息");
			put (36031, "网络繁忙，请稍候再试");
			put (36032, "离线文件因含有违规内容被系统屏蔽无法下载");
			put(-19, "请输入验证码");
		}
	};
}